.svn/pristine/0c/0c8b5134d8751e8a1351408e6fbbb2a9ab491c0d.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetSignPolicyPDF>
         <tem:strUserId>___insurer_integration_agent_code___</tem:strUserId>
         <tem:strPassword>___insurer_integration_location_code___</tem:strPassword>
         <tem:strProdType>Private Car - P</tem:strProdType>
         <tem:strPolicyNo>___policy_number___</tem:strPolicyNo>
         <tem:strPolicyIssueTime>___current_date___</tem:strPolicyIssueTime>
         <tem:strTransactionID>___transaction_id___</tem:strTransactionID>
         <tem:strTransactionRef>___pg_reference_number_1___</tem:strTransactionRef>
         <tem:strCustomerName>___first_name__</tem:strCustomerName>
         <tem:strPolicyPDF>___pdf_binary_data___</tem:strPolicyPDF>
	 <tem:strAccessKey>___insurer_integration_service_password___</tem:strAccessKey>
      </tem:GetSignPolicyPDF>
   </soapenv:Body>
</soapenv:Envelope>

